STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4R9I-Discovery/stm32l4r9i_discovery_audio.c
/** @addtogroup STM32L4R9I_DISCOVERY_AUDIO_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes microphone related peripherals.
  * @note   This function assumes that the SAI input clock (through PLL_M)
  *         is already configured and ready to be used.
  * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
  * @param  BitRes: Audio frequency to be configured for the SAI peripheral.
  * @param  ChnlNbr: Audio frequency to be configured for the SAI peripheral.
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{
  return BSP_AUDIO_IN_InitEx(INPUT_DEVICE_DIGITAL_MIC, AudioFreq, BitRes, ChnlNbr);
}

/**
  * @brief  Initialize wave recording.
  * @param  InputDevice: INPUT_DEVICE_DIGITAL_MIC, INPUT_DEVICE_DIGITAL_MIC1,
  *                      INPUT_DEVICE_DIGITAL_MIC2 or INPUT_DEVICE_ANALOG_MIC.
  * @param  AudioFreq: Audio frequency to be configured.
  * @param  BitRes: Audio bit resolution to be configured..
  * @param  ChnlNbr: Number of channel to be configured.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_InitEx(uint16_t InputDevice, uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{
  /* Update the audio input context */
  hAudioIn.AudioDrv           = &cs42l51_drv;
  hAudioIn.InputDevice        = InputDevice;
  hAudioIn.Frequency          = AudioFreq;
  hAudioIn.BitResolution      = BitRes;
  hAudioIn.ChannelNbr         = ChnlNbr;
  hAudioIn.CbError            = (Audio_CallbackTypeDef)NULL;
  hAudioIn.CbHalfTransfer     = (Audio_CallbackTypeDef)NULL;
  hAudioIn.CbTransferComplete = (Audio_CallbackTypeDef)NULL;

  /* Check channel number according device : only record mono with analog mic and stereo with digital mic are allowed */
  if(((InputDevice == INPUT_DEVICE_DIGITAL_MIC) && (ChnlNbr == 1)) ||
     ((InputDevice == INPUT_DEVICE_DIGITAL_MIC1) && (ChnlNbr == 2)) ||
     ((InputDevice == INPUT_DEVICE_DIGITAL_MIC2) && (ChnlNbr == 2)) ||
     ((InputDevice == INPUT_DEVICE_ANALOG_MIC) && (ChnlNbr == 2)))
  {
    return AUDIO_ERROR;
  }

  /* Check if output device is currently used */
  if(hAudioOut.OutputDevice != 0)
  {
    /* If output device is currently used, SAI PLL is already initialized */
    /* Check that AudioFreq for record and playback is the same */
    if(hAudioIn.Frequency != hAudioOut.Frequency)
    {
      return AUDIO_ERROR;
    }
  }
  else
  {
    /* Configure the SAI PLL according to the requested audio frequency */
    if (AUDIO_SAIPLLConfig(AudioFreq) != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }

  if(InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    /* Initializes the Digital Filter for Sigma-Delta Modulators interface */
    if(AUDIO_DFSDMx_Init(AudioFreq) != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  else
  { /* INPUT_DEVICE_ANALOG_MIC */
    /* If output device is currently used, SAI is already initialized */
    if(hAudioOut.OutputDevice == 0)
    {
      /* SAI data transfer preparation: prepare the Media to be used for the audio
      transfer from SAI peripheral to memory. */
      if(AUDIO_SAIx_Init(AudioFreq) != AUDIO_OK)
      {
        return AUDIO_ERROR;
      }
    }

    /* Initialize the audio codec internal registers */
    if(hAudioIn.AudioDrv->Init(AUDIO_I2C_ADDRESS,
                               (hAudioOut.OutputDevice | hAudioIn.InputDevice),
                               hAudioOut.Volume,
                               AudioFreq) != 0)
    {
      return AUDIO_ERROR;
    }
  }

  /* Initialise transfer control flag */
  DmaLeftRecHalfBuffCplt  = 0;
  DmaLeftRecBuffCplt      = 0;
  DmaRightRecHalfBuffCplt = 0;
  DmaRightRecBuffCplt     = 0;

  return AUDIO_OK;
}

/**
  * @brief  De-Initializes microphone related peripherals.
  * @retval BSP AUDIO status

  */
uint8_t BSP_AUDIO_IN_DeInit(void)
{
  if(hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    /* De-initializes the Digital Filter for Sigma-Delta Modulators interface */
    if (AUDIO_DFSDMx_DeInit() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  else
  { /* INPUT_DEVICE_ANALOG_MIC */
    /* Check if output device is currently used */
    if(hAudioOut.OutputDevice != 0)
    {
      /* Reset record path on audio codec */
      if(hAudioOut.AudioDrv->Init(AUDIO_I2C_ADDRESS,
                                 hAudioOut.OutputDevice,
                                 (uint8_t) hAudioOut.Volume,
                                 hAudioOut.Frequency) != 0)
      {
        return AUDIO_ERROR;
      }
    }
    else
    {
      /* De-initializes SAI interface */
      if(AUDIO_SAIx_DeInit() != AUDIO_OK)
      {
        return AUDIO_ERROR;
      }

      /* DeInit audio codec */
      hAudioIn.AudioDrv->DeInit();
    }
  }

  /* Disable SAI PLL if no more device is used */
  if(hAudioOut.OutputDevice == 0)
  {
    if (AUDIO_SAIx_PLL_DISABLE() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }

  /* Reset the audio input context */
  memset(&hAudioIn, 0, sizeof(hAudioIn));

  return AUDIO_OK;
}

/**
  * @brief  Starts audio recording.
  * @param  pbuf: Main buffer pointer for the recorded data storing
  * @param  size: Current size of the recorded buffer
  * @note   The Right channel is start at first with synchro on start of Left channel
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_Record(uint16_t* pbuf, uint32_t size)
{
  hAudioIn.pRecBuf = pbuf;
  hAudioIn.RecSize = size;


  if(hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    if((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Allocate hAudioIn.LeftRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      hAudioIn.LeftRecBuff  = (int32_t *)k_malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#else
      hAudioIn.LeftRecBuff  = (int32_t *)malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#endif
      if(hAudioIn.LeftRecBuff == NULL)
      {
        return AUDIO_ERROR;
      }
    }

    if((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Allocate hAudioIn.RightRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      hAudioIn.RightRecBuff  = (int32_t *)k_malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#else
      hAudioIn.RightRecBuff  = (int32_t *)malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#endif
      if(hAudioIn.RightRecBuff == NULL)
      {
        return AUDIO_ERROR;
      }
    }

    if((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Call the Media layer start function for right channel */
      if(HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmRightFilter,
                                          (int32_t*)hAudioIn.RightRecBuff,
                                          (hAudioIn.RecSize/hAudioIn.ChannelNbr)) != HAL_OK)
      {
        return AUDIO_ERROR;
      }
    }

    if((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Call the Media layer start function for left channel */
      if(HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmLeftFilter,
                                          (int32_t*)hAudioIn.LeftRecBuff,
                                          (hAudioIn.RecSize/hAudioIn.ChannelNbr)) != HAL_OK)
      {
        return AUDIO_ERROR;
      }
    }
  }
  else
  { /* INPUT_DEVICE_ANALOG_MIC */
    /* Call the audio Codec Play function */
    if (hAudioIn.AudioDrv->Play(AUDIO_I2C_ADDRESS, pbuf, size) != 0)
    {
      return AUDIO_ERROR;
    }

