STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4R9I-Discovery/stm32l4r9i_discovery_audio.c
    /* Start the process receive DMA */
    if(HAL_OK != HAL_SAI_Receive_DMA(&BSP_AUDIO_hSai_Rx, (uint8_t*)pbuf, size))
    {
      return AUDIO_ERROR;
    }
  }

  return AUDIO_OK;
}

/**
  * @brief  Updates the audio frequency.
  * @param  AudioFreq: Audio frequency used to record the audio stream.
  * @note   This API should be called after the BSP_AUDIO_IN_Init() to adjust the
  *         audio frequency.
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_SetFrequency(uint32_t AudioFreq)
{
  uint8_t TxData[2] = {0x00, 0x00};

  /* Configure the SAI PLL according to the requested audio frequency */
  if (AUDIO_SAIPLLConfig(AudioFreq) != AUDIO_OK)
  {
    return AUDIO_ERROR;
  }

  if (hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    /* De-initializes the Digital Filter for Sigma-Delta Modulators interface */
    if(AUDIO_DFSDMx_DeInit() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }

    /* Initializes the Digital Filter for Sigma-Delta Modulators interface */
    if(AUDIO_DFSDMx_Init(AudioFreq) != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  else
  { /* INPUT_DEVICE_ANALOG_MIC */
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(&BSP_AUDIO_hSai_Tx);
    __HAL_SAI_DISABLE(&BSP_AUDIO_hSai_Rx);

    /* Update the SAI audio frequency configuration */
    BSP_AUDIO_hSai_Tx.Init.Mckdiv = SAIClockDivider(AudioFreq);
    HAL_SAI_Init(&BSP_AUDIO_hSai_Tx);
    BSP_AUDIO_hSai_Rx.Init.Mckdiv = SAIClockDivider(AudioFreq);
    HAL_SAI_Init(&BSP_AUDIO_hSai_Rx);

    /* Enable SAI peripheral to generate MCLK */
    __HAL_SAI_ENABLE(&BSP_AUDIO_hSai_Tx);
    /* Transmit one byte to start FS generation */
    if(HAL_SAI_Transmit(&BSP_AUDIO_hSai_Tx, TxData, 2, 1000) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }

  hAudioIn.Frequency = AudioFreq;

  return AUDIO_OK;
}

/**
  * @brief  Regular conversion complete callback.
  * @note   In interrupt mode, user has to read conversion value in this function
            using HAL_DFSDM_FilterGetRegularValue.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t index;
  uint32_t recbufsize = (hAudioIn.RecSize/hAudioIn.ChannelNbr);

  if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[2 * index]       = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
      hAudioIn.pRecBuf[(2 * index) + 1] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC1)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC2)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }

  /* Invoke the registered 'TransferCompete' callback function (if any) */
  if (hAudioIn.CbTransferComplete != (Audio_CallbackTypeDef)NULL)
  {
    if(hdfsdm_filter == &BSP_AUDIO_hDfsdmLeftFilter)
    {
      if (DmaLeftRecBuffCplt) BSP_ErrorHandler();

      DmaLeftRecBuffCplt = 1;
    }
    else
    {
      if (DmaRightRecBuffCplt) BSP_ErrorHandler();

      DmaRightRecBuffCplt = 1;
    }

    if (((DmaLeftRecBuffCplt != 0) && (DmaRightRecBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC)) ||
        ((DmaLeftRecBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC1)) ||
        ((DmaRightRecBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC2)))
    {
      hAudioIn.CbTransferComplete();
      DmaLeftRecBuffCplt = 0;
      DmaRightRecBuffCplt = 0;
    }
  }
}

/**
  * @brief  Half regular conversion complete callback.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t index;
  uint32_t recbufsize = (hAudioIn.RecSize/hAudioIn.ChannelNbr);

  if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC)
  {
    for (index = 0; index < (recbufsize / 2); index++)
    {
      hAudioIn.pRecBuf[2 * index]       = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
      hAudioIn.pRecBuf[(2 * index) + 1] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC1)
  {
    for (index = 0; index < (recbufsize / 2); index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC2)
  {
    for (index = 0; index < (recbufsize / 2); index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }

  /* Invoke the registered 'HalfTransfer' callback function (if any) */
  if (hAudioIn.CbHalfTransfer != (Audio_CallbackTypeDef)NULL)
  {
    if(hdfsdm_filter == &BSP_AUDIO_hDfsdmLeftFilter)
    {
      if (DmaLeftRecHalfBuffCplt) BSP_ErrorHandler();

      DmaLeftRecHalfBuffCplt = 1;
    }
    else
    {
      if (DmaRightRecHalfBuffCplt) BSP_ErrorHandler();

      DmaRightRecHalfBuffCplt = 1;
    }


    if (((DmaLeftRecHalfBuffCplt != 0) && (DmaRightRecHalfBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC)) ||
        ((DmaLeftRecHalfBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC1)) ||
        ((DmaRightRecHalfBuffCplt != 0) && (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC2)))
    {
      hAudioIn.CbHalfTransfer();
      DmaLeftRecHalfBuffCplt = 0;
      DmaRightRecHalfBuffCplt = 0;
    }
  }
}

/**
  * @brief  Error callback.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterErrorCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  /* Invoke the registered 'ErrorCallback' callback function (if any) */
  if (hAudioIn.CbError != (Audio_CallbackTypeDef)NULL)
  {
    hAudioIn.CbError();
  }
}

/**
  * @brief  SAI Rx Transfer completed callbacks.
  * @param  hsai: SAI handle
  * @retval None
  */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Invoke the registered 'TransferComplete' function (if any) */
  if (hAudioIn.CbTransferComplete != (Audio_CallbackTypeDef)NULL)
  {
    hAudioIn.CbTransferComplete();
  }
}

/**
  * @brief  SAI Rx Half Transfer completed callbacks.
  * @param  hsai: SAI handle
  * @retval None
  */
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Invoke the registered 'HalfTransfer' callback function (if any) */
  if (hAudioIn.CbHalfTransfer != (Audio_CallbackTypeDef)NULL)
  {
    hAudioIn.CbHalfTransfer();
  }
}

/**
  * @brief  Stops audio recording.
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_Stop(void)
{
  if (hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Call the Media layer stop function for right channel */
      if(HAL_DFSDM_FilterRegularStop_DMA(&BSP_AUDIO_hDfsdmRightFilter) != HAL_OK )
      {
        return AUDIO_ERROR;
      }
    }
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Call the Media layer stop function for left channel */
      if(HAL_DFSDM_FilterRegularStop_DMA(&BSP_AUDIO_hDfsdmLeftFilter) != HAL_OK )
      {
        return AUDIO_ERROR;
      }
    }

    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Free hAudioIn.LeftRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      k_free((void *)hAudioIn.LeftRecBuff);
#else
      free((void *)hAudioIn.LeftRecBuff);
#endif
    }
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Free hAudioIn.RightRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      k_free((void *)hAudioIn.RightRecBuff);
#else
      free((void *)hAudioIn.RightRecBuff);
#endif
    }
  }
  else
  { /* INPUT_DEVICE_ANALOG_MIC */
    /* Call Audio Codec Stop function */
    if (hAudioIn.AudioDrv->Stop(AUDIO_I2C_ADDRESS, CODEC_PDWN_HW) != 0)
    {
      return AUDIO_ERROR;
    }

